//28.03.2023
//================================================================

extern void my_printf (const char*, ...);

//================================================================

int main (void)
{
        my_printf("I %s %x %d%%%c%b\n", "love",  3802, -100, 33, 15     );
        my_printf ("%d %d %d %d\n", -1, -2, -3, -4);

        my_printf ("==[ZA WARUDO]==\n");
        my_printf ("TOKI WO TOMARE!\n");

                my_printf ("%u %u %u %u %u %u %u\n", 1, 2, 3, 4, 5, 6, 7);

                my_printf (     "Спрашивает Алеша Попович у %s%c\n", "Ильи Муромца",':');
                my_printf (     "Сколько будет %o(%u) + %x(%d)?\n"
                                "%b(%u)! Отвечает Илья Муромец.\n", 150, 150, 150, 150, 320, 320);
                my_printf (     "Почему? - Спрашивает %s\n"
                                "Так %s ещё %d весит!\n", "Алёша Попович.", "гриф", 20);


        return 0;
}
